app/Services/AuthService.php

    public function autenticar(string $email, string $senha): array
    {
        $dataAtual = date('Y-m-d');
        $usuario = $this->usuarios->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'teste2@email.com'
AND `usuarios`.`deleted_at` IS NULL
 LIMIT 1