app/Models/ItensVistoriados.php

    public function listarPorVistoria($idVistoria)
    {
        return $this->withDeleted()->select('
            itensvistoriados.*,
            itensparavistorias.nome_item AS nome_item
        ')
            ->join('itensparavistorias', 'itensparavistorias.id = itensvistoriados.id_item_condominio', 'left')
            ->where('itensvistoriados.id_vistoria', $idVistoria)
            ->orderBy('itensparavistorias.nome_item', 'ASC')
            ->findAll();
---
SELECT `itensvistoriados`.*, `itensparavistorias`.`nome_item` AS `nome_item`
FROM `itensvistoriados`
LEFT JOIN `itensparavistorias` ON `itensparavistorias`.`id` = `itensvistoriados`.`id_item_condominio`
WHERE `itensvistoriados`.`id_vistoria` = 204
ORDER BY `itensparavistorias`.`nome_item` ASC