app/Models/NiveisModel.php

SELECT *
FROM `niveis`
WHERE `niveis`.`id` = 50
---
    public function buscarPorId(int $id): ?array
    {
        return $this->find($id);

SELECT *
FROM `niveis`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `niveis`
---
    public function listarComPaginacao(int $limite = 10, int $pagina = 1): array
    {
        return $this->orderBy('id', 'DESC')
            ->paginate($limite, 'default', $pagina);