app/Models/VisitasModel.php

SELECT COUNT(*) AS `numrows`
FROM `visitas`
WHERE `visitas`.`id_condominio` = 1
---
    public function contarVisitasPorCondominio(int $id): int
    {
        return $this->builder()
            ->where('visitas.id_condominio', $id)
            ->countAllResults();