app/Models/VistoriasModel.php

    public function contarVistoriasPorCondominio(int $id): int
    {
        return $this->builder()
            ->where('vistorias.id_condominio', $id)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `vistorias`
WHERE `vistorias`.`id_condominio` = 1